inits.org
#+TITLE: M-EMACS
#+OPTIONS: toc:nil
#+EXPORT_FILE_NAME: README.md
* About
  M-EMACS is a custom GNU Emacs setup and configurations that aims to enhance the default Emacs experience. This configuration is designed that, if the user clones this repository into their =HOME= directory set in Windows Environment Variables, and there is a stable connection to Melpa Packages, then they can use most of my custom EMACS configurations out-of-the-box! Exceptions are noted as *Prerequisite*, simple =Ctrl-F= will lead you there.

  This configuration is designed and tested for *GNU Emacs 25.1 and above only*.
*** Cool Thing About This README
    This README originated from [[file:init.org][init.org]] that is generated using =M-x org-gfm-export-to-markdown=. Every block of code is generated through this function - it exports the section of code from =elisp/= directory. You will not see their presence in
*** Modifications?
    Of course you can modify M-EMACS! You have the permission to use, modify, distribute however you want and free of charge, but without any warranty. (See [[file:LICENSE][LICENSE]])

    *Remember* you must manually sync this README with all the new changes you made by:
    1. If you add a new mode, create a new =<file-name>.el= file in =elisp/= directory.
    2. Put =(require '<file-name>)= in [[file:init.el][init.el]] accordingly.
    3. Add =#+INCLUDE: "~/.emacs.d/elisp/<place-holder>.el" src emacs-lisp :lines "<start-line>-<end-line-exclusive>"= in the appropriate section in [[file:init.org][init.org]].
    4. Call =M-x org-gfm-export-to-markdown= to update this README.
* Table of Contents                                               :TOC_2_org:
- [[About][About]]
- [[Startup][Startup]]
  - [[Lexical-binding][Lexical-binding]]
  - [[Disable Unnecessary Interface][Disable Unnecessary Interface]]
  - [[Optimization][Optimization]]
- [[Package Management][Package Management]]
  - [[Melpa Packages][Melpa Packages]]
  - [[Configure Package Management][Configure Package Management]]
  - [[Use-Package Wrapper][Use-Package Wrapper]]
  - [[Auto Package Update][Auto Package Update]]
- [[Global Functionalities][Global Functionalities]]
  - [[Owner Information][Owner Information]]
  - [[Bindings][Bindings]]
  - [[Directory Management][Directory Management]]
  - [[AG][AG]]
  - [[Avy][Avy]]
  - [[Ivy][Ivy]]
  - [[Winner][Winner]]
  - [[Swiper][Swiper]]
  - [[Which Key][Which Key]]
  - [[Popup Kill Ring][Popup Kill Ring]]
  - [[Undo Tree][Undo Tree]]
  - [[Discover My Major][Discover My Major]]
  - [[Configs][Configs]]
  - [[More Functions][More Functions]]
- [[User Interface Enhancements][User Interface Enhancements]]
  - [[Title Bar][Title Bar]]
  - [[All The Icons][All The Icons]]
  - [[Doom Theme][Doom Theme]]
  - [[Doom Modeline][Doom Modeline]]
  - [[Dashboard][Dashboard]]
  - [[Page Break Lines][Page Break Lines]]
  - [[Fonts][Fonts]]
  - [[Zone Mode Screensaver][Zone Mode Screensaver]]
  - [[Diminish][Diminish]]
  - [[Dimmer][Dimmer]]
  - [[Smooth Scroll][Smooth Scroll]]
  - [[Line Numbers][Line Numbers]]
  - [[Pretty Symbols][Pretty Symbols]]
  - [[UI Configs][UI Configs]]
- [[General Programming][General Programming]]
  - [[Magit][Magit]]
  - [[Projectile][Projectile]]
  - [[Treemacs][Treemacs]]
  - [[Company][Company]]
  - [[Flycheck][Flycheck]]
  - [[Dumb Jump][Dumb Jump]]
  - [[Parenthesis Pairing][Parenthesis Pairing]]
  - [[Format All][Format All]]
  - [[Highlight Indent Guides][Highlight Indent Guides]]
  - [[LSP][LSP]]
- [[Programming][Programming]]
  - [[Emacs Lisp][Emacs Lisp]]
  - [[Java][Java]]
  - [[C/C++][C/C++]]
  - [[Python][Python]]
  - [[Arduino][Arduino]]
- [[Web Development][Web Development]]
  - [[Web Mode][Web Mode]]
  - [[Emmet][Emmet]]
  - [[JavaScript][JavaScript]]
  - [[TypeScript][TypeScript]]
- [[Miscellaneous][Miscellaneous]]
  - [[Org][Org]]
  - [[EWW][EWW]]
  - [[Tetris][Tetris]]
  - [[Speed Type][Speed Type]]
  - [[2048 Game][2048 Game]]
- [[Credits][Credits]]

* Startup
** Lexical-binding
   Use lexical-binding. [[https://nullprogram.com/blog/2016/12/22/][Why?]]
   #+BEGIN_QUOTE
   Until Emacs 24.1 (June 2012), Elisp only had dynamically scoped variables, a feature, mostly by accident, common to old lisp dialects. While dynamic scope has some selective uses, it’s widely regarded as a mistake for local variables, and virtually no other languages have adopted it.
   #+END_QUOTE
   #+INCLUDE: "~/.emacs.d/elisp/init-customization.el" src emacs-lisp :lines "1-2"
** Disable Unnecessary Interface
   This need to be in the beginning of initialization to smooth the experience.
   #+INCLUDE: "~/.emacs.d/init.el" src emacs-lisp :lines "10-14"
** Optimization
   Avoid garbage collection during startup.
   #+INCLUDE: "~/.emacs.d/init.el" src emacs-lisp :lines "16-25"
   Unset file name handler alist.
   #+INCLUDE: "~/.emacs.d/init.el" src emacs-lisp :lines "26-34"
   Load all elisp files in =elisp/= and =site-elisp/= to reduce startup time.
   #+INCLUDE: "~/.emacs.d/init.el" src emacs-lisp :lines "36-51"
* Package Management
** Melpa Packages
   #+INCLUDE: "~/.emacs.d/elisp/init-package-management.el" src emacs-lisp :lines "4-13"
** Configure Package Management
   #+INCLUDE: "~/.emacs.d/elisp/init-package-management.el" src emacs-lisp :lines "15-27"
** Use-Package Wrapper
   My Emacs configuration is almost entirely dependant on a faster implementation of [[https://github.com/jwiegley/use-package][use-package]] based on [[https://github.com/hlissner/doom-emacs/blob/master/core/core-packages.el#L323][Doom Emacs]].
   #+BEGIN_QUOTE
   The =use-package= macro allows you to isolate package configuration in your .emacs file in a way that is both performance-oriented and, well, tidy. I created it because I have over 80 packages that I use in Emacs, and things were getting difficult to manage. Yet with this utility my total load time is around 2 seconds, with no loss of functionality!
   #+END_QUOTE
   Add the macro generated list of package.el loadpaths to load-path.
   #+INCLUDE: "~/.emacs.d/elisp/init-package-management.el" src emacs-lisp :lines "29-54"
   The =use-package= wrapper.
   #+INCLUDE: "~/.emacs.d/elisp/init-package-management.el" src emacs-lisp :lines "55-64"
** Auto Package Update
   [[https://github.com/rranelli/auto-package-update.el][Auto package update]] automatically updates installed packages if at least =auto-package-update-interval= days have passed since the last update.
   #+INCLUDE: "~/.emacs.d/elisp/init-package-management.el" src emacs-lisp :lines "66-71"
* Global Functionalities
** Owner Information
   *Prerequisite*: Change this to your information.
   #+BEGIN_SRC emacs-lisp
     (setq user-full-name "Mingde (Matthew) Zeng")
     (setq user-mail-address "matthewzmd@gmail.com")
   #+END_SRC
** Bindings
   Unbind C-z to use as prefix
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-z") nil)
   #+END_SRC
   Use iBuffer instead of Buffer List
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-x C-b") 'ibuffer)
   #+END_SRC
   Truncate lines
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-x C-!") 'toggle-truncate-lines)
   #+END_SRC
   Adjust font size like web browsers
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "C-+") 'text-scale-increase)
     (global-set-key (kbd"C--") 'text-scale-decrease)
   #+END_SRC
   Move up/down paragraph
   #+BEGIN_SRC emacs-lisp
     (global-set-key (kbd "M-n") 'forward-paragraph)
     (global-set-key (kbd "M-p") 'backward-paragraph)
   #+END_SRC
** Directory Management
*** Dired
    Dired, the directory editor.
    #+INCLUDE: "~/.emacs.d/elisp/init-dired.el" src emacs-lisp :lines "3-26"
*** Autosave and Backup
    Create directory where Emacs stores backups and autosave files.
    #+INCLUDE: "~/.emacs.d/elisp/init-dired.el" src emacs-lisp :lines "28-30"
    Set autosave and backup directory.
    #+INCLUDE: "~/.emacs.d/elisp/init-dired.el" src emacs-lisp :lines "31-36"
*** Rename Both File and Buffer
    #+INCLUDE: "~/.emacs.d/elisp/init-dired.el" src emacs-lisp :lines "39-53"
*** File Configs
    #+INCLUDE: "~/.emacs.d/elisp/init-dired.el" src emacs-lisp :lines "54-62"
** AG
   [[https://github.com/ggreer/the_silver_searcher][AG The Silver Searcher]], a code-searching tool similar to ack, but faster.

   *Prerequisite*: [[https://github.com/k-takata/the_silver_searcher-win32][AG for Windows]] must be installed and put in the Path.
   #+BEGIN_SRC emacs-lisp
     (def-package ag
       :defer t
       :bind ("C-z s" . ag))
   #+END_SRC
** Avy
   [[https://github.com/abo-abo/avy][Avy]], a nice way to move around text.
   #+BEGIN_SRC emacs-lisp
     (def-package avy
       :defer t
       :bind
       (("C-;" . avy-goto-char-timer)
        ("C-:" . avy-goto-line))
       :config
       (setq avy-timeout-seconds 0.3)
       (setq avy-style 'pre))
   #+END_SRC
** Ivy
*** Main Ivy
    [[https://github.com/abo-abo/swiper][Ivy]], a generic completion mechanism for Emacs.
    #+BEGIN_SRC emacs-lisp
      (def-package ivy
        :diminish ivy-mode
        :init (ivy-mode 1)
        :config
        (setq ivy-use-virtual-buffers t)
        (setq ivy-height 10)
        (setq ivy-on-del-error-function nil)
        (setq ivy-magic-slash-non-match-action nil)
        (setq ivy-count-format "【%d/%d】")
        (setq ivy-wrap t))
   #+END_SRC
*** Amx
    [[https://github.com/DarwinAwardWinner/amx][Amx]], a M-x enhancement tool forked from [[https://github.com/nonsequitur/smex][Smex]].
    #+BEGIN_SRC emacs-lisp
      (def-package amx
        :after (:any ivy ido)
        :config (amx-mode))
    #+END_SRC
*** Counsel
    [[https://github.com/abo-abo/swiper][Counsel]], a collection of Ivy-enhanced versions of common Emacs commands.
    #+BEGIN_SRC emacs-lisp
      (def-package counsel
        :after ivy
        :diminish counsel-mode
        :init (counsel-mode 1))
    #+END_SRC
** Winner
   Winner mode restores old window layout.
   #+BEGIN_SRC emacs-lisp
     (def-package winner
       :ensure nil
       :commands (winner-undo winner-redo)
       :init (setq winner-boring-buffers
                   '("*Completions*"
                     "*Compile-Log*"
                     "*inferior-lisp*"
                     "*Fuzzy Completions*"
                     "*Apropos*"
                     "*Help*"
                     "*cvs*"
                     "*Buffer List*"
                     "*Ibuffer*"
                     "*esh command on file*")))
   #+END_SRC
** Swiper
   [[https://github.com/abo-abo/swiper][Swiper]], an Ivy-enhanced alternative to isearch.
   #+BEGIN_SRC emacs-lisp
     (def-package swiper
       :bind ("C-s" . swiper))
   #+END_SRC
** Which Key
   [[https://github.com/justbur/emacs-which-key][Which key]], a feature that displays the key bindings following the incomplete command.
   #+BEGIN_SRC emacs-lisp
     (def-package which-key
       :diminish
       :init
       (setq which-key-separator " ")
       (setq which-key-prefix-prefix "+")
       :config
       (which-key-mode))
   #+END_SRC
** Popup Kill Ring
   [[https://github.com/waymondo/popup-kill-ring][Popup kill ring]], a feature that provides the ability to browse Emacs kill ring in autocomplete style popup menu.
   #+BEGIN_SRC emacs-lisp
     (def-package popup-kill-ring
       :bind ("M-y" . popup-kill-ring))
   #+END_SRC
** Undo Tree
   [[https://www.emacswiki.org/emacs/UndoTree][Undo tree]], a feature that provides a visualization of the undos in a file.
   #+BEGIN_SRC emacs-lisp
     (def-package undo-tree
       :defer t
       :diminish undo-tree-mode
       :init (global-undo-tree-mode))
   #+END_SRC
** Discover My Major
   [[https://github.com/jguenther/discover-my-major][Discover my major]], a feature that discovers key bindings and their meaning for the current Emacs major mode.
   #+BEGIN_SRC emacs-lisp
     (def-package discover-my-major
       :bind (("C-h C-m" . discover-my-major)))
   #+END_SRC
** Configs
   Some essential configs that make my life a lot easier.
*** UTF-8 Coding System
    Use UTF-8 as much as possible with unix line endings.
    #+BEGIN_SRC emacs-lisp
      (prefer-coding-system 'utf-8-unix)
      (set-language-environment "UTF-8")
      (set-default-coding-systems 'utf-8-unix)
      (set-terminal-coding-system 'utf-8-unix)
      (set-keyboard-coding-system 'utf-8-unix)
      (set-selection-coding-system 'utf-8-unix)
      (setq locale-coding-system 'utf-8-unix)
      ;; Treat clipboard input as UTF-8 string first; compound text next, etc.
      (when (display-graphic-p)
        (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
    #+END_SRC
*** Turn Off Cursor Alarms
    #+BEGIN_SRC
      (setq ring-bell-function 'ignore)
    #+END_SRC
*** Turn Off Blink Cursor
    #+BEGIN_SRC emacs-lisp
      (blink-cursor-mode -1)
    #+END_SRC
*** Show Keystrokes in Progress Instantly
    #+BEGIN_SRC emacs-lisp
      ;; Show keystrokes in progress
      (setq echo-keystrokes 0.1)
    #+END_SRC
*** Optimize Editing Experience
    #+BEGIN_SRC emacs-lisp
      ;; Remove useless whitespace before saving a file
      (add-hook 'before-save-hook 'whitespace-cleanup)
      (add-hook 'before-save-hook (lambda() (delete-trailing-whitespace)))

      ;; Make sentences end with a single space
      (setq-default sentence-end-double-space nil)

      ;; When buffer is closed, saves the cursor location
      (save-place-mode 1)

      ;; Disable Shift mark
      (setq shift-select-mode nil)

      ;; Replace selection on insert
      (delete-selection-mode 1)

      ;; Merge system clipboard with Emacs
      (setq-default select-enable-clipboard t)

      ;; Prevent Extraneous Tabs
      (setq-default indent-tabs-mode nil)
    #+END_SRC
*** Automatic Garbage Collect
    Garbage collect when Emacs is not in focus.
    #+BEGIN_SRC emacs-lisp
      (add-hook 'focus-out-hook #'garbage-collect)
    #+END_SRC
*** Move Custom-Set-Variables to Different File
    #+BEGIN_SRC emacs-lisp
      (setq custom-file (concat user-emacs-directory "elisp/init-customization.el"))
      (load custom-file 'noerror)
    #+END_SRC
** More Functions
   Other important, but longer functions.
*** Resize Window Width / Height Functions
    #+BEGIN_SRC emacs-lisp
      ;; Resizes the window width based on the input
      (defun window-resize-width (w)
        "Resizes the window width based on W."
        (interactive (list (if (> (count-windows) 1)
                               (read-number "Set the current window width in [1~9]x10%: ")
                             (error "You need more than 1 window to execute this function!"))))
        (message "%s" w)
        (window-resize nil (- (truncate (* (/ w 10.0) (frame-width))) (window-total-width)) t))

      ;; Resizes the window height based on the input
      (defun window-resize-height (h)
        "Resizes the window height based on H."
        (interactive (list (if (> (count-windows) 1)
                               (read-number "Set the current window height in [1~9]x10%: ")
                             (error "You need more than 1 window to execute this function!"))))
        (message "%s" h)
        (window-resize nil (- (truncate (* (/ h 10.0) (frame-height))) (window-total-height)) nil))

      ;; Setup shorcuts for window resize width and height
      (global-set-key (kbd "C-x C-|") #'window-resize-width)
      (global-set-key (kbd "C-x C-_") #'window-resize-height)
    #+END_SRC
*** Edit This Configuration File Shortcut
    #+BEGIN_SRC emacs-lisp
      (defun edit-configs ()
        "Opens the README.org file."
        (interactive)
        (find-file "~/.emacs.d/README.org"))

      (global-set-key (kbd "C-z e") #'edit-configs)
    #+END_SRC
