inits.org
*** Smarter Move Beginning of Line
    Smarter navigation to the beginning of a line by [[https://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/][Bozhidar Batsov]].
    #+BEGIN_SRC emacs-lisp
      (defun smarter-move-beginning-of-line (arg)
        "Move point back to indentation of beginning of line.

      Move point to the first non-whitespace character on this line.
      If point is already there, move to the beginning of the line.
      Effectively toggle between the first non-whitespace character and
      the beginning of the line.

      If ARG is not nil or 1, move forward ARG - 1 lines first.  If
      point reaches the beginning or end of the buffer, stop there."
        (interactive "^p")
        (setq arg (or arg 1))

        ;; Move lines first
        (when (/= arg 1)
          (let ((line-move-visual nil))
            (forward-line (1- arg))))

        (let ((orig-point (point)))
          (back-to-indentation)
          (when (= orig-point (point))
            (move-beginning-of-line 1))))

      ;; remap C-a to `smarter-move-beginning-of-line'
      (global-set-key [remap move-beginning-of-line]
                      'smarter-move-beginning-of-line)
    #+END_SRC
* User Interface Enhancements
** Title Bar
   #+BEGIN_SRC emacs-lisp
     (setq-default frame-title-format '("M-EMACS - " user-login-name "@" system-name " - %b"))
   #+END_SRC
** All The Icons
   [[https://github.com/domtronn/all-the-icons.el][All The Icons]], a utility package to collect various Icon Fonts and propertize them within Emacs.

   *Prerequisite*: Install all fonts from =/fonts/all-the-icons-fonts=.
   #+BEGIN_SRC emacs-lisp
     (def-package all-the-icons)
   #+END_SRC
*** All The Icons Dired
    [[https://github.com/jtbm37/all-the-icons-dired][All The Icons Dired]], an icon set for Dired.
    #+BEGIN_SRC emacs-lisp
      (def-package all-the-icons-dired
        :after all-the-icons
        :diminish
        :config (add-hook 'dired-mode-hook #'all-the-icons-dired-mode)
        :custom-face (all-the-icons-dired-dir-face ((t `(:foreground ,(face-background 'default))))))
    #+END_SRC
*** All The Icons Ivy
    [[https://github.com/asok/all-the-icons-ivy][All The Icons Ivy]], an icon set for Ivy.
    #+BEGIN_SRC emacs-lisp
      (def-package all-the-icons-ivy
        :after all-the-icons
        :config
        (all-the-icons-ivy-setup)
        (setq all-the-icons-ivy-buffer-commands '())
        (setq all-the-icons-ivy-file-commands
              '(counsel-find-file counsel-file-jump counsel-recentf counsel-projectile-find-file counsel-projectile-find-dir)))
    #+END_SRC
** Doom Theme
   [[https://github.com/hlissner/emacs-doom-themes][doom-themes]], an UI plugin and pack of theme. It is set to default to Molokai theme.
   #+BEGIN_SRC emacs-lisp
     (def-package doom-themes
       :config
       ;; flashing mode-line on errors
       (doom-themes-visual-bell-config)
       ;; Corrects (and improves) org-mode's native fontification.
       (doom-themes-org-config)
       (load-theme 'doom-molokai t))
   #+END_SRC
** Doom Modeline
   [[https://github.com/seagle0128/doom-modeline][Doom modeline]], a modeline from DOOM Emacs, but more powerful and faster.
   #+BEGIN_SRC emacs-lisp
     (def-package doom-modeline
       :hook (after-init . doom-modeline-mode)
       :config
       ;; Don't compact font caches during GC. Windows Laggy Issue
       (setq inhibit-compacting-font-caches t)
       (setq doom-modeline-minor-modes t)
       ;;(setq doom-modeline-github t) ;; requires ghub package
       (setq doom-modeline-icon t)
       (setq doom-modeline-major-mode-color-icon t)
       (setq doom-modeline-height 15))
   #+END_SRC
** Dashboard
   [[https://github.com/rakanalh/emacs-dashboard][Dashboard]], an extensible Emacs startup screen.

   Use either =KEC_Dark_BK.png= or =KEC_Light_BK.png= depends on the backgrond theme.
   #+BEGIN_SRC emacs-lisp
     (def-package dashboard
       :diminish (dashboard-mode page-break-lines-mode)
       :config
       (dashboard-setup-startup-hook)
       (setq dashboard-banner-logo-title "Close the world. Open the nExt.")
       (setq dashboard-startup-banner "~/.emacs.d/images/KEC_Dark_BK_Small.png")

       (defun open-dashboard ()
         "Open the *dashboard* buffer and jump to the first widget."
         (interactive)
         (if (get-buffer dashboard-buffer-name)
             (kill-buffer dashboard-buffer-name))
         (dashboard-insert-startupify-lists)
         (switch-to-buffer dashboard-buffer-name)
         (goto-char (point-min))
         (if (> (length (window-list-1))
                ;; exclude `treemacs' window
                (if (and (fboundp 'treemacs-current-visibility)
                         (eq (treemacs-current-visibility) 'visible)) 2 1))
             (setq dashboard-recover-layout-p t))
         (delete-other-windows))
       (global-set-key (kbd "C-z d") #'open-dashboard)

       ;; Additional Dashboard widgets.
       (defun dashboard-insert-widgets (list-size)
         (insert (format "%d packages loaded in %s.\n" (length package-activated-list) (emacs-init-time)))
         (insert "Navigation: ")
         ;;(insert (make-string (max 0 (floor (/ (- dashboard-banner-length 25) 2))) ?\ ))
         (widget-create 'url-link
                        :tag (propertize "Github" 'face 'font-lock-keyword-face)
                        :help-echo "Open the Emacs Configuration Github page"
                        :mouse-face 'highlight
                        "https://github.com/MatthewZMD/.emacs.d")
         (insert " ")
         (widget-create 'push-button
                        :help-echo "Edit This Emacs' Configuration"
                        :action (lambda (&rest _) (edit-configs))
                        :mouse-face 'highlight
                        :button-prefix ""
                        :button-suffix ""
                        (propertize "Configuration" 'face 'font-lock-keyword-face)))

       (add-to-list 'dashboard-item-generators  '(buttons . dashboard-insert-widgets))
       (add-to-list 'dashboard-items '(buttons)))
   #+END_SRC
** Page Break Lines
   [[https://github.com/purcell/page-break-lines][Page-break-lines]], a feature that displays ugly form feed characters as tidy horizontal rules.
   #+BEGIN_SRC emacs-lisp
     (def-package page-break-lines
       :diminish
       :init (global-page-break-lines-mode))
   #+END_SRC
** Fonts
   Prepares fonts to use.

   *Prerequisite*: Install =Input= and =Love Letter TW= fonts from =/fonts=.
   #+BEGIN_SRC emacs-lisp
     ;; Input Mono, Monaco Style, Line Height 1.3 download from http://input.fontbureau.com/
     (defvar fonts '(("Input" . 11) ("SF Mono" . 12) ("Consolas" . 12) ("Love LetterTW" . 12.5))
       "List of fonts and sizes.  The first one available will be used.")
   #+END_SRC
   Change Font Function.
   #+BEGIN_SRC emacs-lisp
     (defun change-font ()
       "Documentation."
       (interactive)
       (let* (available-fonts font-name font-size font-setting)
         (dolist (font fonts (setq available-fonts (nreverse available-fonts)))
           (when (member (car font) (font-family-list))
             (push font available-fonts)))

         (if (not available-fonts)
             (message "No fonts from the chosen set are available")
           (if (called-interactively-p 'interactive)
               (let* ((chosen (assoc-string (completing-read "What font to use? " available-fonts nil t) available-fonts)))
                 (setq font-name (car chosen) font-size (read-number "Font size: " (cdr chosen))))
             (setq font-name (caar available-fonts) font-size (cdar available-fonts)))

           (setq font-setting (format "%s-%d" font-name font-size))
           (set-frame-font font-setting nil t)
           (add-to-list 'default-frame-alist (cons 'font font-setting)))))

     (change-font)
   #+END_SRC
** Zone Mode Screensaver
   [[https://www.emacswiki.org/emacs/ZoneMode][Zone mode]], a minor-mode 'zones' Emacs out, choosing one of its random modes to obfuscate the current buffer, which is used as my Emacs screensaver.
   #+BEGIN_SRC emacs-lisp
     (def-package zone
       :ensure nil
       :config
       (zone-when-idle 300) ;; in seconds

       (defun zone-choose (pgm)
         "Choose a PGM to run for `zone'."
         (interactive
          (list
           (completing-read
            "Program: "
            (mapcar 'symbol-name zone-programs))))
         (let ((zone-programs (list (intern pgm))))
           (zone))))
   #+END_SRC
** Diminish
   [[https://github.com/emacsmirror/diminish][Diminish]], a feature that removes certain minor modes from mode-line.
   #+BEGIN_SRC emacs-lisp
     (def-package diminish)
   #+END_SRC

** Dimmer
   [[https://github.com/gonewest818/dimmer.el][Dimmer]], a feature that visually highlights the selected buffer.
   #+BEGIN_SRC emacs-lisp
     (def-package dimmer
       :init (dimmer-mode)
       :config
       (setq dimmer-fraction 0.2)
       (setq dimmer-exclusion-regexp "\\*Minibuf-[0-9]+\\*\\|\\*dashboard\\*"))
   #+END_SRC
** Smooth Scroll
   Smoothens Scrolling.
   #+BEGIN_SRC emacs-lisp
     (setq scroll-step 1)
     (setq scroll-margin 1)
     (setq scroll-conservatively 101)
     (setq scroll-up-aggressively 0.01)
     (setq scroll-down-aggressively 0.01)
     (setq auto-window-vscroll nil)
     (setq redisplay-dont-pause t)
     (setq fast-but-imprecise-scrolling nil)
     (setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
     (setq mouse-wheel-progressive-speed nil)
   #+END_SRC
** Line Numbers
   Display line numbers, and column numbers in modeline.
   #+BEGIN_SRC emacs-lisp
     ;; Hook line numbers to only when files are opened
     (if (version< emacs-version "26")
         (progn (add-hook 'find-file-hook #'linum-mode)
                (add-hook 'prog-mode-hook #'linum-mode))
       (progn (add-hook 'find-file-hook #'display-line-numbers-mode)
              (add-hook 'prog-mode-hook #'display-line-numbers-mode)))

     ;; Display column numbers in modeline
     (column-number-mode 1)
   #+END_SRC
