inits.org
** Pretty Symbols
   Pretty the Symbols.
   #+BEGIN_SRC emacs-lisp
     (global-prettify-symbols-mode 1)
       (defun add-pretty-lambda ()
         "make some word or string show as pretty Unicode symbols"
         (setq prettify-symbols-alist
               '(
                 ("lambda" . 955)
                 ("->" . 8594)
                 ("=>" . 8658)
                 ("map" . 8614)
                 )))
       (add-hook 'prog-mode-hook 'add-pretty-lambda)
   #+END_SRC
** UI Configs
   Maximize frame.
   #+BEGIN_SRC emacs-lisp
     (add-to-list 'default-frame-alist '(fullscreen . maximized))
   #+END_SRC
   Disable splash screen and change scratch message.
   #+BEGIN_SRC emacs-lisp
     (setq inhibit-startup-screen t)
     (setq initial-scratch-message ";; Present Day, Present Time...")
   #+END_SRC
   Change yes or no prompts to y or n.
   #+BEGIN_SRC emacs-lisp
     (fset 'yes-or-no-p 'y-or-n-p)
   #+END_SRC
* General Programming
** Magit
   [[https://magit.vc/][Magit]], an interface to the version control system Git.
   #+BEGIN_SRC emacs-lisp
     (def-package magit
       :bind ("C-x g" . magit-status))
   #+END_SRC
** Projectile
   [[https://github.com/bbatsov/projectile][Projectile]], a Project Interaction Library for Emacs.

   *Prerequisite*: Install [[https://github.com/bmatzelle/gow][Gow]] before proceding and make sure it is in the Path. Gow is a lightweight installer that installs useful open source UNIX applications compiled as native win32 binaries. Especially, =tr= is needed for Projectile alien indexing.
   #+BEGIN_SRC emacs-lisp
     (def-package projectile
       :bind
       ("C-c p" . projectile-command-map)
       ("C-z i" . projectile-switch-project)
       ("C-z o" . projectile-find-file)
       ("C-z p" . projectile-add-known-project)
       :config
       (projectile-mode +1)
       (setq projectile-completion-system 'ivy)
       (when (eq system-type 'windows-nt)
         (setq projectile-indexing-method 'alien))
       (add-to-list 'projectile-globally-ignored-directories "node_modules"))
   #+END_SRC
** Treemacs
   [[https://github.com/Alexander-Miller/treemacs][Treemacs]], a tree layout file explorer for Emacs.
*** Treemacs
    #+BEGIN_SRC emacs-lisp
      (def-package treemacs
        :init
        (with-eval-after-load 'winum
          (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
        :config
        (progn
          (setq treemacs-collapse-dirs
                (if (executable-find "python") 3 0)
                treemacs-deferred-git-apply-delay   0.5
                treemacs-display-in-side-window     t
                treemacs-file-event-delay     5000
                treemacs-file-follow-delay    0.2
                treemacs-follow-after-init    t
                treemacs-follow-recenter-distance   0.1
                treemacs-git-command-pipe     ""
                treemacs-goto-tag-strategy    'refetch-index
                treemacs-indentation    2
                treemacs-indentation-string   " "
                treemacs-is-never-other-window      nil
                treemacs-max-git-entries      5000
                treemacs-no-png-images        nil
                treemacs-no-delete-other-windows    t
                treemacs-project-follow-cleanup     nil
                treemacs-persist-file   (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
                treemacs-recenter-after-file-follow nil
                treemacs-recenter-after-tag-follow  nil
                treemacs-show-cursor    nil
                treemacs-show-hidden-files    t
                treemacs-silent-filewatch     nil
                treemacs-silent-refresh       nil
                treemacs-sorting        'alphabetic-desc
                treemacs-space-between-root-nodes   t
                treemacs-tag-follow-cleanup   t
                treemacs-tag-follow-delay     1.5
                treemacs-width    35)
          ;; The default width and height of the icons is 22 pixels. If you are
          ;; using a Hi-DPI display, uncomment this to double the icon size.
          ;;(treemacs-resize-icons 44)
          (treemacs-follow-mode t)
          (treemacs-filewatch-mode t)
          (treemacs-fringe-indicator-mode t)
          (pcase (cons (not (null (executable-find "git")))
                       (not (null (executable-find "python3"))))
            (`(t . t) (treemacs-git-mode 'deferred))
            (`(t . _) (treemacs-git-mode 'simple))))
        :bind
        (:map global-map
              ("M-0"       . treemacs-select-window)
              ("C-x t 1"   . treemacs-delete-other-windows)
              ("C-x t t"   . treemacs)
              ("C-x t B"   . treemacs-bookmark)
              ("C-x t C-t" . treemacs-find-file)
              ("C-x t M-t" . treemacs-find-tag)))
   #+END_SRC
*** Treemacs Magit
    #+BEGIN_SRC emacs-lisp
      (def-package treemacs-magit
        :defer t
        :after (treemacs magit))
    #+END_SRC
*** Treemacs Projectile
    #+BEGIN_SRC emacs-lisp
      (def-package treemacs-projectile
        :defer t
        :after (treemacs projectile))
    #+END_SRC
** Company
   [[http://company-mode.github.io/][Company]], short for *Comp*lete *any*thing, a text completion framework for Emacs.
   #+BEGIN_SRC emacs-lisp
     (def-package company
       :diminish company-mode
       :defer t
       :init (global-company-mode)
       :config
       (setq company-minimum-prefix-length 1)
       (setq company-tooltip-align-annotations 't) ; align annotations to the right tooltip border
       (setq company-idle-delay 0) ; decrease delay before autocompletion popup shows
       (setq company-begin-commands '(self-insert-command)) ; start autocompletion only after typing
       (define-key company-mode-map [remap indent-for-tab-command] #'company-indent-or-complete-common)
       (define-key company-active-map (kbd "TAB") 'company-complete-common-or-cycle)
       (define-key company-active-map (kbd "<tab>") 'company-complete-common-or-cycle)
       (define-key company-active-map (kbd "S-TAB") 'company-select-previous)
       (define-key company-active-map (kbd "<backtab>") 'company-select-previous)
       (setq company-require-match 'never))
   #+END_SRC
** Flycheck
   [[https://www.flycheck.org/en/latest/][Flycheck]], a syntax checking extension.
   #+BEGIN_SRC emacs-lisp
     (def-package flycheck
       :defer t
       :hook (prog-mode . flycheck-mode)
       :config
       (flycheck-add-mode 'typescript-tslint 'js2-mode)
       (flycheck-add-mode 'typescript-tslint 'rjsx-mode))
   #+END_SRC
** Dumb Jump
   [[https://github.com/jacktasia/dumb-jump][Dumb jump]], an Emacs "jump to definition" package.
   #+BEGIN_SRC emacs-lisp
     (def-package dumb-jump
       :bind (("M-g o" . dumb-jump-go-other-window)
        ("M-g j" . dumb-jump-go)
        ("M-g i" . dumb-jump-go-prompt)
        ("M-g x" . dumb-jump-go-prefer-external)
        ("M-g z" . dumb-jump-go-prefer-external-other-window))
       :config (setq dumb-jump-selector 'ivy))
   #+END_SRC
** Parenthesis Pairing
   Match and automatically pair parenthesis.
   #+BEGIN_SRC emacs-lisp
     ;; Show matching parenthesis
     (setq show-paren-delay 0)
     (show-paren-mode 1)
   #+END_SRC
