inits.org
*** Smartparens
    [[https://github.com/Fuco1/smartparens][Smartparens]], a minor mode for dealing with pairs.
    #+BEGIN_SRC emacs-lisp
      (def-package smartparens
        :demand t
        :diminish smartparens-mode
        :bind (:map smartparens-mode-map
                    ("C-M-f" . sp-forward-sexp)
                    ("C-M-b" . sp-backward-sexp)
                    ("C-M-d" . sp-down-sexp)
                    ("C-M-a" . sp-backward-down-sexp)
                    ;; C-S-d is bound to dup line
                    ("C-S-b" . sp-beginning-of-sexp)
                    ("C-S-a" . sp-end-of-sexp)
                    ("C-M-e" . sp-up-sexp)
                    ("C-M-u" . sp-backward-up-sexp)
                    ("C-M-t" . sp-transpose-sexp)
                    ("C-M-n" . sp-forward-hybrid-sexp)
                    ("C-M-p" . sp-backward-hybrid-sexp)
                    ("C-M-k" . sp-kill-sexp)
                    ("C-M-w" . sp-copy-sexp)
                    ("M-<delete>" . sp-unwrap-sexp)
                    ;; I like using M-<backspace> to del backwards
                    ;; ("C-<backspace>" . sp-backward-unwrap-sexp)
                    ("C-<right>" . sp-forward-slurp-sexp)
                    ("C-<left>" . sp-forward-barf-sexp)
                    ("C-M-<left>" . sp-backward-slurp-sexp)
                    ("C-M-<right>" . sp-backward-barf-sexp)
                    ("M-D" . sp-splice-sexp)
                    ;; This is Ctrl-Alt-Del lol
                    ;; ("C-M-<delete>" . sp-splice-sexp-killing-forward)
                    ("C-M-<backspace>" . sp-splice-sexp-killing-backward)
                    ("C-S-<backspace>" . sp-splice-sexp-killing-around)
                    ("C-]" . sp-select-next-thing-exchange)
                    ("C-<left_bracket>" . sp-select-previous-thing)
                    ("C-M-]" . sp-select-next-thing)
                    ("M-F" . sp-forward-symbol)
                    ("M-B" . sp-backward-symbol)
                    ("C-\"" . sp-change-inner)
                    ("M-i" . sp-change-enclosing))
        :config
        (smartparens-global-mode)
        ;; Stop pairing single quotes in elisp
        (sp-local-pair 'emacs-lisp-mode "'" nil :actions nil)
        (sp-local-pair 'org-mode "[" nil :actions nil)
        (setq sp-escape-quotes-after-insert nil))
    #+END_SRC
*** Awesome Pair
    [[https://github.com/manateelazycat/awesome-pair][Awesome Pair]], a feature that provides grammatical parenthesis completion. All I need is this smart kill.
    #+BEGIN_SRC emacs-lisp
      (require 'awesome-pair)

      (add-hook 'prog-mode-hook '(lambda () (awesome-pair-mode 1)))

      (define-key awesome-pair-mode-map (kbd "C-c C-k") 'awesome-pair-kill)
    #+END_SRC
** Format All
   [[https://github.com/lassik/emacs-format-all-the-code][Format all]], a feature that lets you auto-format source code.

   *Prerequisite*: Read [[https://github.com/lassik/emacs-format-all-the-code#supported-languages][Supported Languages]] to see which additional tool you need to install for the specific language.
   #+BEGIN_SRC emacs-lisp
     (def-package format-all
       :bind ("C-z f" . format-all-buffer)
       :config (add-hook 'prog-mode-hook #'format-all-mode))
   #+END_SRC
** Highlight Indent Guides
   [[https://github.com/DarthFennec/highlight-indent-guides][Highlight Indent Guides]], a feature that highlights indentation levels.
   #+BEGIN_SRC emacs-lisp
     (def-package highlight-indent-guides
       :defer t
       :config
       (add-hook 'prog-mode-hook #'highlight-indent-guides-mode)
       (setq highlight-indent-guides-method 'character))
   #+END_SRC
** LSP
   [[https://github.com/emacs-lsp/lsp-mode][LSP]], a client/library for the [[https://microsoft.github.io/language-server-protocol/][Language Server Protocol]].
*** LSP Mode
    #+BEGIN_SRC emacs-lisp
      (def-package lsp-mode
        :defer t
        :commands lsp
        :init
        (setq lsp-auto-guess-root nil)
        (setq lsp-prefer-flymake nil)      ; Use lsp-ui and flycheck
        (setq lsp-message-project-root-warning t)
        :hook (prog-mode . lsp))
    #+END_SRC
*** LSP UI
    [[https://github.com/emacs-lsp/lsp-ui][LSP UI]], provides all the higher level UI modules of lsp-mode, like flycheck support and code lenses.
    #+BEGIN_SRC emacs-lisp
      (def-package lsp-ui
        :after lsp-mode
        :diminish
        :commands lsp-ui-mode
        :custom-face
        (lsp-ui-doc-background ((t (:background nil))))
        (lsp-ui-doc-header ((t (:inherit (font-lock-string-face italic)))))
        :bind (:map lsp-ui-mode-map
                    ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
                    ([remap xref-find-references] . lsp-ui-peek-find-references)
                    ("C-c u" . lsp-ui-imenu))
        :init
        (setq lsp-ui-doc-enable t
              lsp-ui-doc-header t
              lsp-ui-doc-include-signature t
              lsp-ui-doc-position 'top
              lsp-ui-doc-use-webkit t
              lsp-ui-doc-border (face-foreground 'default)

              lsp-ui-sideline-enable t
              lsp-ui-sideline-ignore-duplicate t
              lsp-ui-sideline-show-diagnostics nil
              lsp-ui-sideline-show-symbol t
              lsp-ui-sideline-show-hover t
              lsp-ui-sideline-show-code-actions t)
        :config
        ;; WORKAROUND Hide mode-line of the lsp-ui-imenu buffer
        ;; https://github.com/emacs-lsp/lsp-ui/issues/243
        (defadvice lsp-ui-imenu (after hide-lsp-ui-imenu-mode-line activate)
          (setq mode-line-format nil)))
    #+END_SRC
*** Company LSP
    [[https://github.com/tigersoldier/company-lsp][Company LSP]], a Company completion backend for lsp-mode.
    #+BEGIN_SRC emacs-lisp
      (def-package company-lsp
        :after (company lsp-mode)
        :config
        (setq company-lsp-cache-candidates 'auto)
        :commands company-lsp)
    #+END_SRC
*** DAP
    [[https://github.com/emacs-lsp/dap-mode][DAP]], a client/library for the [[https://code.visualstudio.com/api/extension-guides/debugger-extension][Debug Adapter Protocol]].
    #+BEGIN_SRC emacs-lisp
      (def-package dap-mode
        :after lsp-mode
        :defer t
        :config
        (dap-mode t)
        (dap-ui-mode t))
    #+END_SRC
* Programming
** Emacs Lisp
*** Always Add Lexical Binding to New Elisp File
    #+BEGIN_SRC emacs-lisp
      (add-hook 'emacs-lisp-mode-hook
                (lambda () (let  ((auto-insert-query nil)
                             (auto-insert-alist
                              '((("\\.el\\'" . "Emacs Lisp header")
                                 ""
                                 ";;; -*- lexical-binding: t; -*-\n\n"
                                 '(setq lexical-binding t)))))
                        (auto-insert))))
    #+END_SRC
*** Shortcut for Evaluating Elisp
    Eval-buffer for ELisp Code.
    #+BEGIN_SRC emacs-lisp
      (define-key emacs-lisp-mode-map (kbd "<f5>") #'eval-buffer)
    #+END_SRC
** Java
*** LSP Java
    [[https://github.com/emacs-lsp/lsp-java][LSP Java]], Emacs Java IDE using [[https://projects.eclipse.org/projects/eclipse.jdt.ls][Eclipse JDT Language Server]].

    *Prerequisite*: Install [[https://maven.apache.org/download.cgi][Maven]].
    #+BEGIN_SRC emacs-lisp
      (def-package lsp-java
        :after lsp-mode
        :config (add-hook 'java-mode-hook 'lsp))
    #+END_SRC
** C/C++
   *Prerequisite*:
   - Windows OS: Install [[http://www.mingw.org/wiki/Install_MinGW][MinGW]] for Compilation and [[https://cmake.org/download/][CMake]] >= 2.8.3 first.
   - ALl OS: Install [[https://clang.llvm.org/extra/clangd/Installation.html][Clangd]].

   Note: If Displaying =No LSP server for c-mode=, execute =M-x ielm= and verify clangd is installed using =(executable-find "clangd")= or =(executable-find lsp-clients-clangd-executable)=.

   Compile using =<f5>= or =compile=. The command =gcc -o <file>.exe <fileA>.c <fileB>.c ...= is to compile C code into =<file>.exe=.
*** CC Mode
    CC Mode, a mode for editing files containing C, C++, Objective-C, Java, CORBA IDL (and the variants CORBA PSDL and CIDL), Pike and AWK code.
    #+BEGIN_SRC emacs-lisp
      (def-package cc-mode
        :ensure nil
        :defer t
        :bind ("<f5>" . compile))
    #+END_SRC
    Rest of the features will be provided by [[https://github.com/emacs-lsp/lsp-mode][LSP Mode]].
** Python
*** TODO Microsoft's Python Language Server - [[https://github.com/melpa/melpa/pull/6027][Use Melpa Once it's Ready]]
    [[https://github.com/andrew-christianson/lsp-python-ms][LSP Python MS]], a lsp-mode client leveraging [[https://github.com/Microsoft/python-language-server][Microsoft's Python Language Server]].

    *Prerequisite*:
    Install [[https://dotnet.microsoft.com/download][.NET Core SDK]]. Then execute the following commands from your =HOME= or =~= path:
    #+BEGIN_SRC text
      git clone https://github.com/Microsoft/python-language-server.git
      cd python-language-server/src/LanguageServer/Impl
      dotnet build -c Release
      dotnet publish -c Release -r win10-x64
    #+END_SRC
    Change the value after =-r= flag (=win10-x64=) depending on your architecture and OS. See Microsoft's [[https://docs.microsoft.com/en-us/dotnet/core/rid-catalog][Runtime ID Catalog]] for the correct value for your OS.

    Now, put =~/.emacs.d\python-language-server\output\bin\Release\win10-x64\publish= in your PATH.
   #+BEGIN_SRC emacs-lisp
     (def-package lsp-python-ms
       :after lsp-mode
       :ensure nil
       :hook (python-mode . lsp)
       :config
       ;; for dev build of language server
       (setq lsp-python-ms-dir
             (expand-file-name "~/.emacs.d/python-language-server/output/bin/Release/"))
       ;; for executable of language server, if it's not symlinked on your PATH
       (setq lsp-python-ms-executable
             "~/.emacs.d/python-language-server/output/bin/Release/win10-x64/publish/Microsoft.Python.LanguageServer"))
   #+END_SRC
** Arduino
*** Arduino Mode
    [[https://github.com/bookest/arduino-mode][Arduino mode]], a major mode for editing Arduino sketches.
    #+BEGIN_SRC emacs-lisp
      (def-package arduino-mode
        :defer t
        :config
        (add-to-list 'auto-mode-alist '("\\.ino\\'" . arduino-mode))
        (add-to-list 'auto-mode-alist '("\\.pde\\'" . arduino-mode))
        (autoload 'arduino-mode "arduino-mode" "Arduino editing mode." t))
   #+END_SRC
