inits.org
*** Company Arduino
    [[https://github.com/yuutayamada/company-arduino][Company Arduino]], a set of configuration to let you auto-completion by using irony-mode, company-irony and company-c-headers on arduino-mode.
    #+BEGIN_SRC emacs-lisp
      (def-package company-arduino
        :defer t
        :config
        (add-hook 'irony-mode-hook 'company-arduino-turn-on)
        ;; Activate irony-mode on arduino-mode
        (add-hook 'arduino-mode-hook 'irony-mode))
    #+END_SRC
* Web Development
** Web Mode
   [[https://github.com/fxbois/web-mode][Web mode]], a major mode for editing web templates.
   #+BEGIN_SRC emacs-lisp
     (def-package web-mode
       :mode
       ("\\.phtml\\'" "\\.tpl\\.php\\'" "\\.[agj]sp\\'" "\\.as[cp]x\\'"
        "\\.erb\\'" "\\.mustache\\'" "\\.djhtml\\'" "\\.[t]?html?\\'" "\\.tsx\\'"))
   #+END_SRC
** Emmet
   [[https://github.com/smihica/emmet-mode][Emmet]], a feature that allows writing HTML using CSS selectors along with =C-j=. See [[https://github.com/smihica/emmet-mode#usage][usage]] for more information.
   #+BEGIN_SRC emacs-lisp
     (def-package emmet-mode
       :hook web-mode
       :config
       (add-hook 'css-mode-hooktype  'emmet-mode)) ;; enable Emmet's css abbreviation
   #+END_SRC
** JavaScript
   [[https://github.com/mooz/js2-mode][JS2 mode]], a feature that offers improved JavsScript editing mode.
   #+BEGIN_SRC emacs-lisp
     (def-package js2-mode
       :mode "\\.js\\'"
       :interpreter "node")
   #+END_SRC
** TypeScript
*** TypeScript Mode
    [[https://github.com/emacs-typescript/typescript.el][TypeScript mode]], a feature that offers TypeScript support for Emacs.
    #+BEGIN_SRC emacs-lisp
      (def-package typescript-mode
        :defer t
        :commands (typescript-mode)
        :bind (:map typescript-mode-map
                    ("M-." . tide-jump-to-definition))
        :init
        (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-mode))
        (defun setup-tide-ts ()
          "Setup tide for typescript."
          (interactive)
          (tide-setup)
          (tide-hl-identifier-mode))
        (add-hook 'typescript-mode-hook #'setup-tide-ts))
    #+END_SRC
*** Tide
    [[https://github.com/ananthakumaran/tide][Tide]], a *T*ypeScript *I*nteractive *D*evelopment *E*nvironment for *E*macs.

    Tip: enter =M-.= to jump to definition.
    #+BEGIN_SRC emacs-lisp
      (def-package tide
        :defer t
        :ensure t
        :bind (:map tide-mode-map
                    ("M-." . nil))
        :commands (tide-setup)
        :after (company flycheck))
    #+END_SRC
* Miscellaneous
** Org
   [[https://orgmode.org/][Org]] is for keeping notes, maintaining TODO lists, planning projects, and authoring documents with a fast and effective plain-text system.
   #+BEGIN_SRC emacs-lisp
     (def-package org
       :ensure nil
       :bind
       ("C-c l" . org-store-link)
       ("C-c a" . org-agenda)
       ("C-c c" . org-capture)
       ("C-c b" . org-switch)
       :config
       (setq org-log-done 'time)
       (setq org-todo-keywords
             '((sequence "TODO" "PROCESS" "VERIFY" "|" "DONE"))))
   #+END_SRC
*** TOC Org
    [[https://github.com/snosov1/toc-org][TOC Org]] generates table of contents for =.org= files
    #+BEGIN_SRC emacs-lisp
      (def-package toc-org
        :hook (org-mode . toc-org-mode))
    #+END_SRC
*** HTMLize
    [[https://github.com/hniksic/emacs-htmlize][HTMLize]], a tool that converts buffer text and decorations to HTML.
    #+BEGIN_SRC emacs-lisp
      (use-package htmlize :defer t)
    #+END_SRC
*** OX-GFM
    [[https://github.com/larstvei/ox-gfm][OX-GFM]], a Github Flavored Markdown exporter for Org Mode.
    #+BEGIN_SRC emacs-lisp
      (def-package ox-gfm
        :defer t)
    #+END_SRC
** EWW
   EWW, the Emacs Web Wowser.
*** Set EWW as Default Browser
    In Eww, hit & to browse this url system browser
    #+BEGIN_SRC emacs-lisp
      (setq browse-url-browser-function 'eww-browse-url)
    #+END_SRC
*** Auto-Rename New EWW Buffers
    #+BEGIN_SRC emacs-lisp
      (defun xah-rename-eww-hook ()
        "Rename eww browser's buffer so sites open in new page."
        (rename-buffer "eww" t))
      (add-hook 'eww-mode-hook #'xah-rename-eww-hook)

      ;; C-u M-x eww will force a new eww buffer
      (defun force-new-eww-buffer (orig-fun &rest args)
        "ORIG-FUN ARGS When prefix argument is used, a new eww buffer will be created,
        regardless of whether the current buffer is in `eww-mode'."
        (if current-prefix-arg
            (with-temp-buffer
              (apply orig-fun args))
          (apply orig-fun args)))
      (advice-add 'eww :around #'force-new-eww-buffer)
    #+END_SRC
** Tetris
   Although [[https://www.emacswiki.org/emacs/TetrisMode][Tetris]] is part of Emacs, but there still could be some configurations.
   #+BEGIN_SRC emacs-lisp
     (defvar tetris-mode-map
       (make-sparse-keymap 'tetris-mode-map))
     (define-key tetris-mode-map (kbd "C-p") 'tetris-rotate-prev)
     (define-key tetris-mode-map (kbd "C-n") 'tetris-move-down)
     (define-key tetris-mode-map (kbd "C-b") 'tetris-move-left)
     (define-key tetris-mode-map (kbd "C-f") 'tetris-move-right)
     (define-key tetris-mode-map (kbd "C-SPC") 'tetris-move-bottom)
     (defadvice tetris-end-game (around zap-scores activate)
       (save-window-excursion ad-do-it))
   #+END_SRC
** Speed Type
   [[https://github.com/hagleitn/speed-type][Speed type]], a game to practice touch/speed typing in Emacs.
   #+BEGIN_SRC emacs-lisp
     (def-package speed-type
       :defer t)
   #+END_SRC
** 2048 Game
   [[https://bitbucket.org/zck/2048.el][2048 Game]], an implementation of 2048 in Emacs.
   #+BEGIN_SRC emacs-lisp
     (def-package 2048-game
       :defer t)
   #+END_SRC
* Credits
  This Emacs configuration was influenced and inspired by the following configurations.
  - [[https://github.com/seagle0128/.emacs.d][Vincent Zhang's Centaur Emacs]]
  - [[https://github.com/hlissner/doom-emacs][Henrik Lissner's Doom Emacs]]
  - [[https://github.com/poncie/.emacs.d][Poncie Reyes's .emacs.d]]
